<a href="https://colab.research.google.com/github/meninblack110/titanic/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [12]:
import pandas as pd

1)

In [13]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

2)

In [16]:
survival_rate= df['Survived'].mean()
print (f'Survival percentage is {survival_rate}')

Survival percentage is 0.3838383838383838

3)

In [18]:
male_survive=df[(df['Sex']=='male')&(df['Survived']==1)]
print (f'Numbers of male survived is {len(male_survive)}')

Numbers of male survived is 109

In [19]:
female_survive=df[(df['Sex']=='female')&(df['Survived']==1)]
print (f'Numbers of female survived is {len(female_survive)}')

Numbers of female survived is 233

4)

In [21]:
pay_less_than_10= df[df['Fare']<10]

In [23]:
rate=pay_less_than_10['Survived'].mean()

In [24]:
print (f'Survival percentage is {rate}')

Survival percentage is 0.19940476190476192

5)

In [26]:
not_survived= df[df['Survived'] == 0]
avg_age= not_survived['Age'].mean()
print (f'average age of those who did not survive is {avg_age}')

average age of those who did not survive is 30.62617924528302

6)

In [27]:
survived= df[df['Survived'] == 1]
avg_age_1= survived['Age'].mean()
print (f'average age of those who did not survive is {avg_age_1}')

average age of those who did not survive is 28.343689655172415

2nd way for problem 5 and 6

In [29]:
df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

7)

In [28]:
df.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64